---
kind: type
id: T:Autodesk.Revit.DB.SlabShapeCreaseType
source: html/15cd619f-b946-f03b-bc51-291227889a22.htm
---
# Autodesk.Revit.DB.SlabShapeCreaseType

An enumerated type listing all Crease types of Slab Shape Edit.

## Syntax (C#)
```csharp
public enum SlabShapeCreaseType
```